{
  "HomeLayout": {
    "title": "João Vítor Ferraz - Fullstack Developer",
    "description": "Experienced fullstack developer with 3 years of expertise in React, Node.js, and TypeScript. Fluent in Portuguese, English, and Spanish. Based in Florianópolis, Brazil."
  },
  "Footer": {
    "cv-name": "resume",
    "cv-link": "/english-cv.pdf"
  },
  "Switch": {
    "sr-text": "Click to change to the language:"
  },
  "Navigation": {
    "about": "about",
    "work": "work"
  },
  "Heading": {
    "exp-title": "3 years",
    "exp-subtitle": "experience",
    "stack-title": "react / node",
    "stack-subtitle": "main stack",
    "location-title": "floripa / br",
    "location-subtitle": "location",
    "languages-title": "pt, en, es",
    "languages-subtitle": "languages"
  },
  "Profile": {
    "subtitle": "fullstack developer",
    "email-text": "Click to email me (opens your client mail)",
    "email-address": "mailto:jvkferraz@gmail.com",
    "linkedin-text": "Click to open my LinkedIn Profile",
    "github-text": "Click to open my Github Profile"
  },
  "Bio": {
    "text": [
      "Hey there! My name is João, but you can call me Jay!",
      "I'm a full-stack software developer with three years of experience. I mainly use TypeScript to build clean, performant applications. My go-to stack is React & Node, paired with frameworks like Next and Express, and tools such as Docker and Git.",
      "I'm highly adaptable and have built many transferable skills that enable me to participate in all steps of the product development cycle. These include problem-solving, effective communication, and work on agile methodologies."
    ],
    "link-paragraph": "Want to find out more about my skills in action? Check out my ",
    "link-text": "work tab."
  },
  "Work": {
    "Experience": {
      "title": "experience",
      "jobs": [
        {
          "title": "frontend developer I & II @ Q4 inc",
          "period": "sep 2022 - may 2024",
          "description": "while at Q4, i deployed various websites and solutions for their ir clients using js, sass, and mustache.js. i handled several projects that involved complex figma designs and multiple stakeholders. i also managed internal tools, such as a scraper built with puppeteer (node + ts), and contributed to improving our squad’s integration, leading to enhancements in our communication, design system, and projects with fewer bugs. my career highlight working there was when I built the website for Johnson & Johnson - specially, i used the papaparse library to create a custom pipeline page that displayed information from an excel table provided by them."
        },
        {
          "title": "freelance developer",
          "period": "jan 2022 - present",
          "description": "i taught myself web development and have been building projects for study, personal use, and for other independent professionals who trust my services to create high-converting applications. i also began contributing to open source projects after studying the curriculum from the odin project, which was the beginning of my journey in this area alongside a fullstack bootcamp that i did at ironhack."
        }
      ]
    },
    "Skills": {
      "title": "skills",
      "list": [
        {
          "title": "languages",
          "tech": "typescript"
        },
        {
          "title": "frontend",
          "tech": "react, next, astro, tailwind, styled components, sass, vite, webpack"
        },
        {
          "title": "backend",
          "tech": "node, express, postgresql, mongodb, prismaorm, jwt, oauth, rest, mvc"
        },
        {
          "title": "others",
          "tech": "jest, tdd, git, linux, docker, solid, ci/cd"
        }
      ]
    }
  },
  "NotFound": {
    "title": "This page does not exists!",
    "message": "Go back to the home page:",
    "link-text": "click here"
  }
}
