{
  "HomeLayout": {
    "title": "João Vítor Ferraz - Fullstack Developer",
    "description": "Software Engineer who transforms challenges into robust technology solutions. With 3 years of experience building differentiated, responsive, and scalable Frontend applications in the TypeScript and React ecosystem, plus backend experience with Node.js, REST APIs, databases, and DevOps practices. Based in Florianópolis, Brazil."
  },
  "Footer": {
    "cv-name": "resume",
    "cv-link": "/english-cv.pdf"
  },
  "Switch": {
    "sr-text": "Click to change to the language:"
  },
  "Navigation": {
    "about": "about",
    "work": "work"
  },
  "Heading": {
    "exp-title": "3 years",
    "exp-subtitle": "experience",
    "stack-title": "react / node",
    "stack-subtitle": "main stack",
    "location-title": "floripa / br",
    "location-subtitle": "location",
    "languages-title": "pt, en, es",
    "languages-subtitle": "languages"
  },
  "Profile": {
    "subtitle": "fullstack developer",
    "email-text": "Click to email me (opens your client mail)",
    "email-address": "mailto:jvkferraz@gmail.com",
    "linkedin-text": "Click to open my LinkedIn Profile",
    "github-text": "Click to open my Github Profile"
  },
  "Bio": {
    "text": [
      "Software Engineer who transforms challenges into robust technology solutions. Nice to meet you, I'm João!",
      "With 3 years of experience and a passion for problem-solving, since entering the field I've been seeking to stay in tune with the fundamentals of computing and keep up with the latest technologies for the Internet. This pursuit of knowledge translates into important achievements, such as the recent completion of Harvard's CS50x course."
    ],
    "link-paragraph": "Want to find out more about my skills in action? Check out my ",
    "link-text": "work tab."
  },
  "Work": {
    "Experience": {
      "title": "experience",
      "jobs": [
        {
          "title": "fullstack developer @ dynamox",
          "period": "nov 2024 - present",
          "description": "as a member of the core foundation team, i build and maintain critical applications, improve developer productivity across the organization, and manage cloud infrastructure. i develop and maintain features for a micro-frontend platform using vite, react, typescript, materialui, and redux. i designed and implemented from scratch an automated translation application with node.js, typescript, and gemini's ai api to support international market expansion. i performed maintenance on back-end services in node.js with express and mongodb, working on rate limiting and rbac codebases. i manage and provision cloud infrastructure on gcp using terraform (iac). i implement and refactor unit and e2e tests with vitest, rtl, and cypress. i create comprehensive technical documentation and adrs, improving team efficiency."
        },
        {
          "title": "frontend developer @ Q4 inc",
          "period": "sep 2022 - may 2024",
          "description": "i developed and delivered investor relations (ir) websites for over 50 clients using a proprietary cms, javascript, sass, and jquery. i evolved in the role and began maintaining internal tools and facilitating processes between product, design, and qa teams. i led the development of ir websites for johnson & johnson, paypal, and krispy kreme, successfully managing stakeholder expectations. i improved the website production pipeline through standardization of components in figma, improvements in technical communication with clients, and optimization of qa processes. i contributed to the maintenance of internal tools, including a web scraper developed with node.js and puppeteer."
        }
      ]
    },
    "Skills": {
      "title": "skills",
      "list": [
        {
          "title": "languages",
          "tech": "typescript, javascript, python, sql"
        },
        {
          "title": "frontend",
          "tech": "react, next, vite, redux, zustand, materialui, tailwind, sass, cypress, vitest, rtl"
        },
        {
          "title": "backend",
          "tech": "node, nestjs, express, postgresql, mongodb, redis, prismaorm, jwt, oauth, rest, mvc"
        },
        {
          "title": "devops & tools",
          "tech": "docker, terraform, google cloud (gcp), ci/cd, git, new relic, grafana"
        }
      ]
    }
  },
  "NotFound": {
    "title": "This page does not exists!",
    "message": "Go back to the home page:",
    "link-text": "click here"
  }
}
