{
  "HomeLayout": {
    "title": "João Vítor Ferraz - Desenvolvedor Fullstack",
    "description": "Engenheiro de Software que transforma desafios em soluções de tecnologia robustas. Com 3 anos de experiência construindo aplicações Frontend diferenciadas, responsivas e escaláveis no ecossistema TypeScript e React, além de experiência backend com Node.js, APIs REST, bancos de dados e práticas DevOps. Vivendo em Florianópolis, Brasil."
  },
  "Footer": {
    "cv-name": "currículo",
    "cv-link": "/pt-cv.pdf"
  },
  "Switch": {
    "sr-text": "Clique para mudar o idioma para:"
  },
  "Navigation": {
    "about": "sobre",
    "work": "experiência"
  },
  "Heading": {
    "exp-title": "3 anos",
    "exp-subtitle": "experiência",
    "stack-title": "react / node",
    "stack-subtitle": "stack principal",
    "location-title": "floripa / br",
    "location-subtitle": "localização",
    "languages-title": "pt, en, es",
    "languages-subtitle": "idiomas"
  },
  "Profile": {
    "subtitle": "desenvolvedor fullstack",
    "email-text": "Clique para me mandar um email (abre o seu cliente de email)",
    "email-address": "mailto:jvkferraz@gmail.com",
    "linkedin-text": "Clique para abrir meu perfil no LinkedIn",
    "github-text": "Clique para abrir meu perfil no Github"
  },
  "Bio": {
    "text": [
      "Engenheiro de Software que transforma desafios em soluções de tecnologia robustas. Prazer, sou o João!",
      "Com 3 anos de experiência e uma paixão por resolver problemas, desde que entrei na área busco estar em sintonia com as bases do mundo da computação e me atualizar com os lançamentos em tecnologias para a Internet. Essa busca por conhecimento se traduz em conquistas importantes, como a recente conclusão do curso CS50x de Harvard.",
      "Atualmente, minha especialidade é construir aplicações de Frontend diferenciadas, responsivas e escaláveis no ecossistema TypeScript e React. E para garantir a entrega de soluções completas e interagir com outros times, possuo também uma sólida experiência no backend com Node.js, como no desenvolvimento de APIs REST, na integração com diferentes bancos de dados e sistemas de mensageria. Também trabalho com práticas de DevOps, utilizando Docker e Terraform (IaC) para provisionar e gerenciar a infraestrutura na GCP rotineiramente.",
      "Acredito que a tecnologia ganha força através das pessoas. Tenho a sorte de atualmente estar construindo software de ponta para a indústria na Dynamox, onde a comunicação e a proatividade nos permitem entregar soluções diferenciadas para nossos clientes."
    ],
    "link-paragraph": "Quer saber mais sobre minhas habilidades em ação? Confira a ",
    "link-text": "aba de experiência."
  },
  "Work": {
    "Experience": {
      "title": "experiência",
      "jobs": [
        {
          "title": "desenvolvedor fullstack @ dynamox",
          "period": "nov 2024 - o momento",
          "description": "como membro do time principal de Fundação, construo e mantenho aplicações críticas, aprimoro a produtividade dos desenvolvedores em toda a organização e gerencio a infraestrutura em nuvem. desenvolvo e mantenho funcionalidades para uma plataforma de micro-frontends utilizando vite, react, typescript, materialui e redux. projetei e implementei do zero uma aplicação de traduções automatizadas com node.js, typescript e a api de ia do gemini para apoiar a expansão para o mercado internacional. realizei a manutenção de serviços de back-end em node.js com express e mongodb, atuando em codebases de rate limiting e rbac. gerencio e provisiono a infraestrutura em nuvem na gcp utilizando terraform (iac). implemento e refatoro testes unitários e e2e com vitest, rtl e cypress. elaboro documentação técnica abrangente e adrs, melhorando a eficiência da equipe."
        },
        {
          "title": "desenvolvedor frontend @ Q4 inc",
          "period": "set 2022 - mai 2024",
          "description": "desenvolvi e entreguei sites de relações com investidores (ri) para mais de 50 clientes utilizando um cms proprietário, javascript, sass e jquery. evoluí no cargo e passei a também manter ferramentas internas e facilitar processos entre equipes de produto, design e qa. liderei o desenvolvimento do site de ri da johnson & johnson, paypal e krispy kreme, gerenciando com sucesso as expectativas dos stakeholders. aprimorei a pipeline de produção de sites através da padronização de componentes no figma, melhorias na comunicação técnica com os clientes e otimização dos processos de qa. contribuí para a manutenção de ferramentas internas, incluindo um web scraper desenvolvido com node.js e puppeteer."
        }
      ]
    },
    "Skills": {
      "title": "habilidades",
      "list": [
        {
          "title": "linguagens",
          "tech": "typescript, javascript, python, sql"
        },
        {
          "title": "frontend",
          "tech": "react, next, vite, redux, zustand, materialui, tailwind, sass, cypress, vitest, rtl"
        },
        {
          "title": "backend",
          "tech": "node, nestjs, express, postgresql, mongodb, redis, prismaorm, jwt, oauth, rest, mvc"
        },
        {
          "title": "devops & ferramentas",
          "tech": "docker, terraform, google cloud (gcp), ci/cd, git, new relic, grafana"
        }
      ]
    }
  },
  "NotFound": {
    "title": "Essa página não existe!",
    "message": "Voltar para página inicial:",
    "link-text": "clique aqui"
  }
}
